@echo off
echo *************************************************************
echo *                GIT 代码提交批处理                         *
echo *                    Author: DJ                             *
echo *************************************************************
echo;
echo;

echo *************************************************************
echo 当前目录: %cd%
echo;
echo;

echo *************************************************************
echo 当前git版本:
git --version
echo;

echo *************************************************************
echo 本地变更状态:
git status
echo;
echo;

echo *************************************************************
git add -A .
echo 添加变更到本地仓库
echo git add -A .
echo;
echo;

echo *************************************************************
echo 提交变更到本地仓库
@echo off
set /p var=请输入提交说明: 
echo;
git commit -m %var%
echo;
echo;

echo *************************************************************
echo 拉取最新代码...
git pull origin master
echo;
echo;

echo *************************************************************
echo 提交变更到服务器...
git push origin master
echo;
echo;
